ServiceEnergy/Tenzo_v1/CC1310T2bMain.c
// Тестовый передатчик: измеряет напряжение на ADC1 и передает по радиоканалу измерение
// в виде текстовой строки с меткой  MASTER_ID_DEBUG в составе RF пакета
// используется для отладки измерительных цепей и обмена с SIM800
//05.06.24 Добавлен опрос АЦП HX711 30 измерений, формирование пакета Easylink и отправка пакета по радиоканалу
// 4.04.24  Добавлена передача по GSM каналу
// 17.04.24 Отказался от Callback при чтении UART, перешел на UART_MODE_BLOCKING
// 18.04.24 Одновременная работа ADC и GSM
// 19.04.24 Передача по 3 байта, чтобы влезть в 128 байт payload (увеличивать - нельзя)
// 23.04.24 Сделал два буфера и два таска для модема и измерений

#include <CC1310T2b.h>                          //Добавить для всех enum'ов
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <unistd.h>
#include <ti/drivers/GPIO.h>                   //Перенесено из файла interrupts.c примера
#include <ti/sysbios/BIOS.h>

#include <ti/devices/cc13x0/inc/hw_memmap.h>   //Для прямого доступа к регистрам
#include <ti/devices/cc13x0/inc/hw_types.h>
#include <ti/drivers/timer/GPTimerCC26XX.h>
#include <ti/devices/cc13x0/driverlib/sys_ctrl.h>
#include <ti/devices/cc13x0/driverlib/systick.h>
#include <ti/sysbios/knl/Semaphore.h>          //Добавить для определения Task'ов
#include <ti/sysbios/knl/Task.h>

//#include <ti/drivers/ADCBuf.h>                 //Режим ADCBuf
//#include <ti/drivers/adcbuf/ADCBufCC26XX.h>    //Для структуры adcBufParamsExtension
#include <ti/drivers/ADC.h>                    //Режим одиночного преобразования
#include <ti/drivers/UART.h>                   //Для связи с SIM800
//#include <ti/drivers/UART/UARTCC26XX.h>      //Для связи с SIM800 //Нужна только для очистки RX буфера

#include "easylink/EasyLink.h"                 //Библиотека функций RF

//Режим приема пакета данных
#define MASTER_ID_SC                 0xF1 //МДД КЗ
#define MASTER_ID_BASE               0xFF //МДД BASE
#define MASTER_ID_FLASH              0xFA //Прошивка
#define MASTER_ID_DEBUG_T            0xDD //Debug пересылка payload[] в UART как текстовой строки
#define MASTER_ID_DEBUG_A            0xDE //Debug пересылка payload[] в UART как аналоговые измерения
#define MASTER_ID_DEBUG_S            0xDC //Debug пересылка payload[] в UART как аналоговые измерения
#define GROUP_CODE                   0xA1 //вводим коды групп устройств. А1,А2,А3,А4 в группе максимум 4 устройства устройства принимают пакеты только от членов группы
#define UART_MAXLEN                  50 //максимальная длина ответа на команду
#define ADCBUFFERSIZE               (40)

#define F_SAMPLE                    800000
bool flag = FALSE;
union uint64_as_uint8
{
        uint64_t uint;
        uint8_t  buf[8];
        uint16_t buf_int[4];
 };

void IrqD_OUT(uint_least8_t index);
void I_Time(GPTimerCC26XX_Handle handle_I,GPTimerCC26XX_IntMask interruptMask_I);




// Настраиваем аппаратные прерывания
//---------------------------------------------------------------------------------------
void HWI_init(void)
{
    //Здесь добавим прерывание от ноги DATA микросхемы HX711 luck26 29.05.24
    GPIO_setConfig(D_OUT,GPIO_CFG_IN_PU|GPIO_CFG_IN_INT_FALLING);
        GPIO_setCallback(D_OUT,IrqD_OUT);
        GPIO_enableInt(D_OUT);



}

//----------Callback GPTimer
//#pragma FUNCTION_OPTIONS(I_Time, "--opt_level=4 --opt_for_speed=5")

GPTimerCC26XX_Handle hTimer_I;
GPTimerCC26XX_Value I_TimeoutVal,current_tVal;


//Task Variables
Task_Struct TaskStructErrorHandler;  //Обработчик всех аппаратных ошибок
Char ErrorHandlerTaskStack[TASKSTACKSIZE];
Task_Struct TaskStructRFTransmitA;    //RF Transmitter A
Char RFTransmitTaskStackA[TASKSTACKSIZE];
Task_Struct hxTaskStruct;   //Работа с АЦП HX711
Char hxTaskStack[TASKSTACKSIZE];
Task_Struct blinkTaskStruct;    //Мигалка светодиодом
Char blinkTaskStack[TASKSTACKSIZE];
//Переменные для задачи getTemp опрос датчика температуры TMP35
Task_Struct getTempTaskStruct;
Char getTempTaskStack[TASKSTACKSIZE];

//Semaphore Variable (Struct и Handl глобальные, Params при инициализации)
Semaphore_Struct ReadyForTransmitStructA;
Semaphore_Handle ReadyForTransmitA;
Semaphore_Struct GeneralErrorStruct;
Semaphore_Handle GeneralError;
Semaphore_Handle ReadyForHX;//Семафор готовности данных АЦП HX711
Semaphore_Struct ReadyForHXStruct;
Semaphore_Handle ReadyForBlink;//Семафор перехода в задачу мигания
Semaphore_Struct ReadyForBlinkStruct;
Semaphore_Handle ReadyForTemp;//Семафор перехода в задачу опроса термодатчика
Semaphore_Struct ReadyForTempStruct;


char ErrorMsg[50];                                 //Сообщения об аппаратных ошибках

//UART Variables
UART_Params uartParams;
UART_Handle uart;
uint8_t UARTBuff[UART_MAXLEN];                       //Буфер UART читаем по 1 байту можно уменьшить
uint8_t GSMAnswer[UART_MAXLEN];                      //Ответы SIM800
uint16_t UARTCnt;                                    //Счетчик байт GSM ответа

//Переменные АЦП
ADC_Handle ADC_INA125,ADC_TMP_35,ADC_Vin;
ADC_Params params_adc;
uint16_t adcValue2,adcValue3,adcValue4;
uint32_t microVoltBuffer;

//Easy Link Variables
EasyLink_TxPacket txPacket =  { {0}, 0, 0, {0} };     // Пакет данных для передачи по радиоканалу
uint32_t DeviceID;                                    // Присваивается в процедуре GSM_GetSIMNumber() модуля sim800_hub.c
volatile RF_Op* RFCommand;                            // Ссылка на статус структуру со статусом RF операции
extern RF_Handle rfHandle;                            // Определена в EasyLink.c УБРАТЬ static в описании rfHandle (!!!)
RF_InfoVal info;                                      // Определено в RF.h
uint16_t RFStrCnt;                                    // Счетчик символов текстовой строки Buf_T[]
uint8_t Buf_T[EASYLINK_MAX_DATA_LENGTH];              // Буфер для текстовых строк длина строки RFStrCnt
uint8_t Buf_A[EASYLINK_MAX_DATA_LENGTH];              // Буфер для аналоговых измерений всегда заполнен 40 измерениями

//GSM Variable
//union uint64_as_uint8 eccid; //значение оставшихся цифр CCID вместе с DeviceID формирует полный CCID без 2х первых цифр они стандартные 89

//GLOBAL Variable
unsigned int ADCValue[40],ADCValue2[40],ADCValue3[3];
int Temp;
unsigned int adc_value1, adc_value2,adc_value4, VDDio;
uint16_t size_of_print;
char str[400];
char count_bits=0;


void RFModule_init(void);
void UARTModule_init(void);
void HWI_init(void);
void ErrorHandlerTask(UArg arg0, UArg arg1);
void RFTransmitTaskA(UArg arg0, UArg arg1);
void hxTask(void);
void blinkTask(void);
void getTempTask(void);
void IrqD_OUT(uint_least8_t index);

//void I_TimeoutCb(GPTimerCC26XX_Handle handle_I,GPTimerCC26XX_IntMask interruptMask_I);

//void GSM_SendCommand(char *command);
//uint8_t GSM_GetData(char* data);
//void GSMSessionStart(void);

//  ======================================== main ======================================
//-----------------------------------------------------------------------------------------
int main(void)
{
    Task_Params hxTaskParams;
    Task_Params blinkTaskParams;
    Task_Params getTempTaskParams;
    Task_Params TaskParamsErrorHandler;
    Task_Params TaskParamsRFTransmitA;

    Semaphore_Params ReadyForTransmitParamsA;
    Semaphore_Params ReadyForBlinkParams;
    Semaphore_Params ReadyForHXParams;
    Semaphore_Params ReadyForTempParams;

