ServiceEnergy/Tenzo_v1/CC1310T2bMain.c
    CC1310_initGeneral();        //Системный вызов генерируется автоматически Board_init()
   GPIO_init();                 //Обработка GPIO_PinConfig (?) В примере GPIO_init вызывается из потока

    GPIO_toggle(LED1);
    GPIO_toggle(LED2);

    // ВЫключить встроенный DCDC
    HWREG(AON_SYSCTL_BASE) = 0x00000005;  //Регистр PWRCTL - первый в блоке AON_SYSCTL, поэтому смещение 00

    /*
    // Определяем Задачу в которой крутится обработчик всех аппаратных ошибок
    Task_Params_init(&TaskParamsErrorHandler);
    TaskParamsErrorHandler.stackSize = TASKSTACKSIZE;
    TaskParamsErrorHandler.stack = &ErrorHandlerTaskStack;
    TaskParamsErrorHandler.priority = 3;
    Task_construct(&TaskStructErrorHandler, (Task_FuncPtr)ErrorHandlerTask, &TaskParamsErrorHandler, NULL);
*/
    /*
     //============Инициализация АЦП===========================================
     */
    ADC_Params_init(&params_adc);
    ADC_init();
    ADC_INA125  =     ADC_open(CC1310_LAUNCHXL_ADC0,&params_adc);
    ADC_TMP_35  =     ADC_open(CC1310_LAUNCHXL_ADC1,&params_adc);
    ADC_Vin     =     ADC_open(CC1310_LAUNCHXL_ADCVDDS,&params_adc);





    //Инициализация таймера
    GPTimerCC26XX_Params params_I;
    params_I.width = GPT_CONFIG_32BIT;
    params_I.mode = GPT_MODE_PERIODIC;
    params_I.debugStallMode = GPTimerCC26XX_DEBUG_STALL_OFF;
    hTimer_I = GPTimerCC26XX_open(CC1310_LAUNCHXL_GPTIMER0A,&params_I);
   // if(hTimer_I == NULL)while(1);
    I_TimeoutVal = SysCtrlClockGet()/F_SAMPLE-1UL;
    GPTimerCC26XX_setLoadValue(hTimer_I,I_TimeoutVal);
    GPTimerCC26XX_registerInterrupt(hTimer_I,I_Time,GPT_INT_TIMEOUT);



    //Определим задачу опрса АЦП HX711
    Task_Params_init(&hxTaskParams);
    hxTaskParams.stackSize = TASKSTACKSIZE;
    hxTaskParams.priority = 3;
    hxTaskParams.stack = &hxTaskStack;
    Task_construct(&hxTaskStruct, (Task_FuncPtr)hxTask,&hxTaskParams,NULL);

    // Определяем Задачу которая пересылает данные по радио
    Task_Params_init(&TaskParamsRFTransmitA);
    TaskParamsRFTransmitA.stackSize = TASKSTACKSIZE;
    TaskParamsRFTransmitA.stack = &RFTransmitTaskStackA;
    TaskParamsRFTransmitA.priority = 3;
    Task_construct(&TaskStructRFTransmitA, (Task_FuncPtr)RFTransmitTaskA, &TaskParamsRFTransmitA, NULL);

    //Определим задачу мигания светодиодом
    Task_Params_init(&blinkTaskParams);
    blinkTaskParams.stackSize = TASKSTACKSIZE;
    blinkTaskParams.priority = 3;
    blinkTaskParams.stack = &blinkTaskStack;
    Task_construct(&blinkTaskStruct, (Task_FuncPtr)blinkTask,&blinkTaskParams,NULL);

    //Определим задачу определения температуры
    Task_Params_init(&getTempTaskParams);
    getTempTaskParams.stackSize = TASKSTACKSIZE;
    getTempTaskParams.priority = 3;
    getTempTaskParams.stack = &getTempTaskStack;
    Task_construct(&getTempTaskStruct, (Task_FuncPtr)getTempTask,&getTempTaskParams,NULL);

    Semaphore_Params_init(&ReadyForHXParams);   //Семафор готовности данных АЦП
    ReadyForHXParams.mode=Semaphore_Mode_BINARY;
    Semaphore_construct(&ReadyForHXStruct, 0, &ReadyForHXParams);
    ReadyForHX = Semaphore_handle(&ReadyForHXStruct);

    Semaphore_Params_init(&ReadyForBlinkParams);   //Семафор готовности к миганию светодиодом
    ReadyForBlinkParams.mode=Semaphore_Mode_BINARY;
    Semaphore_construct(&ReadyForBlinkStruct, 0, &ReadyForBlinkParams);
    ReadyForBlink = Semaphore_handle(&ReadyForBlinkStruct);

    Semaphore_Params_init(&ReadyForTempParams);   //Семафор готовности к опроса термодатчика
    ReadyForTempParams.mode=Semaphore_Mode_BINARY;
    Semaphore_construct(&ReadyForTempStruct, 0, &ReadyForTempParams);
    ReadyForTemp = Semaphore_handle(&ReadyForTempStruct);

    Semaphore_Params_init(&ReadyForTransmitParamsA);   //Семафор готовности передачи по RF каналу
    ReadyForTransmitParamsA.mode=Semaphore_Mode_BINARY;
    Semaphore_construct(&ReadyForTransmitStructA, 0, &ReadyForTransmitParamsA);
    ReadyForTransmitA = Semaphore_handle(&ReadyForTransmitStructA);

 /*
    Semaphore_Params_init(&GeneralErrorParams); //Семафор Аппаратного сбоя
    GeneralErrorParams.mode=Semaphore_Mode_BINARY;
    Semaphore_construct(&GeneralErrorStruct, 0, &GeneralErrorParams);
    GeneralError = Semaphore_handle(&GeneralErrorStruct);
*/










    BIOS_start();

    return (0);
}


// Задача blink
//--------------------------------------------------------------------------------------
void blinkTask(void)
{
    UARTModule_init();   //Настройка UART
    HWI_init();          //Настройка аппаратных прерываний
    RFModule_init();     //Инициализация Только после старта BIOS, потому, что пользуется семафорами

uint8_t i=0,k=0;
    while(1){
        Semaphore_pend(ReadyForBlink, BIOS_WAIT_FOREVER);
      //Напишем цикл
      for(i=0;i<10;i++)
      {
          GPIO_write(LED1,1);
          Task_sleep(1000);
          GPIO_write(LED1,0);
          Task_sleep(1000);

      }
     /*
      //Здесь в цикле выведем в UART все элементы массива DCValue2
      for(k=0;k<30;k++)
      {
          size_of_print = sprintf (str, "ADCValue[%d] = %d\r\n",k,ADCValue2[k]);
          UART_write(uart,&str,size_of_print);
      }

     // UART_write(uart,&txPacket,txPacket.len);
      size_of_print = sprintf (str, "\r\n");
                UART_write(uart,&str,size_of_print);
    */
      Semaphore_post(ReadyForTemp);
      //Task_sleep(10000);
      //GPIO_enableInt(D_OUT);//Включим прерывание по ноге D_OUT
      //Task_sleep(10000);
    }
}

//Задача в которой опрашиваются АЦП
void getTempTask(void)
{

    //Объявляем переменные
    int_fast16_t ADCStatus;
    unsigned int f,c,v1,v2;

    while(1){

        //Бесконечный цикл
        //Ждём семафора
        Semaphore_pend(ReadyForTemp, BIOS_WAIT_FOREVER);
        //Запускаем преобразование АЦП с выхода датчика температуры TMP35
        ADCStatus = ADC_convert(ADC_TMP_35, &adcValue2);
        //Переводим мокровольты в градусы цельсия
        microVoltBuffer = (int) ADC_convertToMicroVolts(ADC_TMP_35, adcValue2);
        f = microVoltBuffer/1000;
        c = ((f-320)*50)/90;
        Temp = c;
        //v1 = microVoltBuffer/1000;
        //Выводим в UART
        //size_of_print = sprintf (str, "\r\nTemp = %d 'C\r\n\r\n",c);
        //UART_write(uart,&str,size_of_print);
        Task_sleep(1000);
        //Тепеь запустим преобразование и измерим напряжение питания
        ADCStatus = ADC_convert(ADC_Vin, &adcValue3);
        microVoltBuffer = (int) ADC_convertToMicroVolts(ADC_Vin, adcValue3);
        v2 = microVoltBuffer/1000;
        VDDio = v2;
        //size_of_print = sprintf (str, "\r\nVDDext = %d mV\r\n\r\n",v2);
        //UART_write(uart,&str,size_of_print);
        Task_sleep(1000);
        ADCStatus = ADC_convert(ADC_INA125, &adcValue3);
        microVoltBuffer = (int) ADC_convertToMicroVolts(ADC_INA125, adcValue3);
        v1=microVoltBuffer/1000;
        ADCValue[2] = v1;
        size_of_print = sprintf (str, "\r\n%d %d %d\r\n",c,v2,v1);
        UART_write(uart,&str,size_of_print);
        Task_sleep(1000);
        //GPIO_enableInt(D_OUT);//Включим прерывание по ноге D_OUT
        Semaphore_post(ReadyForHX);//Выставили семафор готовности данных АЦП HX711
        Task_sleep(1000);

