ServiceEnergy/Tenzo_v1/CC1310T2bMain.c
    }

}


void I_Time(GPTimerCC26XX_Handle handle_I,GPTimerCC26XX_IntMask interruptMask_I)
{
    int_fast16_t ADCStatus;
    //Обработчик прерывания таймера 5000 Гц
    GPIO_toggle(LED1);

    //GPIO_disableInt(D_OUT);//Отключили внешнее прерывание

    GPTimerCC26XX_setLoadValue(hTimer_I, I_TimeoutVal);//Загрузили значение в счётный регистр таймера
    if(count_bits<24)
    {//Значение АЦП не прочитано
        if(GPIO_read(PD_SCK))//Если нога тактов в "1"
        {
         GPIO_write(PD_SCK,0);//Опустим ногу в "0" и прочтём состояние ноги данных
         if(GPIO_read(D_OUT)>0) {adc_value1++;}
         count_bits++;
        }
        else
        {
            GPIO_write(PD_SCK,1);
            adc_value1<<=1;
        }


    }
    else
    {
        if(GPIO_read(PD_SCK))
        {
            GPIO_write(PD_SCK,0);
            //Останавливаем таймер
            GPTimerCC26XX_stop(hTimer_I);
            //Запускаем внешнее прерывание
           //GPIO_enableInt(D_OUT); //Прерывание включать будем в задаче HX
            count_bits=0;
            //Semaphore_post(ReadyForHX);//Выставили семафор готовности данных АЦП HX711
            //Опросим АЦП INA125 и сохраним результат в переменной adc_value4
            ADCStatus = ADC_convert(ADC_INA125, &adcValue3);
            microVoltBuffer = (int) ADC_convertToMicroVolts(ADC_INA125, adcValue3);
            adc_value4=microVoltBuffer/1000;
           // ADCValue[2] = v1;
            //Выставим семафор готовности опроса АЦП температуры
            Semaphore_post(ReadyForTemp);
        }
        else{
            GPIO_write(PD_SCK,1);
        }
    }
}



//Задача HX711
// -------------------------------------------------------------------------------------
void hxTask(void)
{
    uint8_t count=0;//Подсёт количества измерений
    unsigned char *ptr;
    uint_fast16_t i,j;

    while(1){
        GPIO_write(PD_SCK,0);
      //Ждём семафора
        Semaphore_pend(ReadyForHX, BIOS_WAIT_FOREVER);

        //Теперь всё зависит от значения счётчика count
        if(count>10)
        {
            GPIO_write(PD_SCK,0);
            count=0;
            txPacket.payload[0] = MASTER_ID_DEBUG_S;
            txPacket.payload[1] = DeviceID >> 16;
            txPacket.payload[2] = (DeviceID >> 8) & 0xFF;
            txPacket.payload[3] = DeviceID & 0xFF;
            txPacket.dstAddr[0] = GROUP_CODE;
            txPacket.absTime = 0;
            j=4;
            for(i=0; i<10; i++)
                {
                    ptr = (unsigned char*) &ADCValue2[i];  //Берём адрес текущего элемента массива ADCValue2
                    txPacket.payload[j++]=*(ptr);                               //Сохраняем первый байт
                    txPacket.payload[j++]=*(ptr+1);                             //Сохраняем второй байт
                    txPacket.payload[j++]=*(ptr+2);                             //Сохраняем третий байт
                    txPacket.payload[j++]=*(ptr+3);                             //Сохраняем четвёртый байт
                }//for для значений с АЦП HX711
           // j ++;
            for(i=0; i<10; i++)
                {
                    ptr = (unsigned char*) &ADCValue[i];  //Берём адрес текущего элемента массива ADCValue
                    txPacket.payload[j++]=*(ptr);                               //Сохраняем первый байт
                    txPacket.payload[j++]=*(ptr+1);                             //Сохраняем второй байт
                    txPacket.payload[j++]=*(ptr+2);                             //Сохраняем третий байт
                    txPacket.payload[j++]=*(ptr+3);                             //Сохраняем четвёртый байт
                 }//for для значений с АЦП INA125

            ptr = (unsigned char*) &Temp;  //Берём адрес переменной Temp (в ней хранится значение температуры)
            txPacket.payload[j++]=*(ptr);                               //Сохраняем первый байт
            txPacket.payload[j++]=*(ptr+1);                             //Сохраняем второй байт
            txPacket.payload[j++]=*(ptr+2);                             //Сохраняем третий байт
            txPacket.payload[j++]=*(ptr+3);                             //Сохраняем четвёртый байт

            ptr = (unsigned char*) &VDDio;  //Берём адрес переменной VDDio (в ней хранится значение напряжения питания в миливольтах)
            txPacket.payload[j++]=*(ptr);                               //Сохраняем первый байт
            txPacket.payload[j++]=*(ptr+1);                             //Сохраняем второй байт
            txPacket.payload[j++]=*(ptr+2);                             //Сохраняем третий байт
            txPacket.payload[j++]=*(ptr+3);                             //Сохраняем четвёртый байт

            txPacket.len = 128;
            Semaphore_post(ReadyForTransmitA);//Выставляем семафор готовности передачи по радиоканалу
            //GPIO_enableInt(D_OUT);//Включим прерывание по ноге D_OUT
            //flag = FALSE;
            Task_sleep(1000);//Дрыхнем

        }
        else
        {
            //GPIO_write(PD_SCK,0);
            //Заполняем буфер данными. Инкремент счётчика
             ADCValue2[count]=adc_value1;//Значения с HX711
             ADCValue[count]=adc_value4;//Значения с INA125
             count++;//Инкремент счётчика измерений
             //adc_value1=0;
             //Включаем внешние прерывания
             //Добавим математику
             /*
             adc_value2 = ((adc_value1 - 32123)*98)/106080-1218;
             size_of_print = sprintf (str, "\r\n%d %d %d %d\r\n",adc_value2,ADCValue3[0],ADCValue3[1],ADCValue3[2]);
             UART_write(uart,&str,size_of_print);
             */
             adc_value1=0;
             adc_value2=0;
             adc_value4=0;
             GPIO_enableInt(D_OUT);//Включим прерывание по ноге D_OUT
             Task_sleep(1000);
        }

    }
}





/*
// Задача BIOS, работает непрерывно, оживает по семафору GeneralError
// При работе с семаформаи передаем управление RTOS через Semaphore_pend()
//---------------------------------------------------------------------------------------
void ErrorHandlerTask(UArg arg0, UArg arg1)
{
int i,l;
  while(1){ //Сюда попадаем только при критических ошибках
     Semaphore_pend(GeneralError, BIOS_WAIT_FOREVER); //Ждем наступления семафора
     txPacket.payload[0] = MASTER_ID_DEBUG_T;
     txPacket.payload[1] = DeviceID >> 16;
     txPacket.payload[2] = (DeviceID >> 8) & 0xFF;
     txPacket.payload[3] = DeviceID & 0xFF;
     txPacket.dstAddr[0] = GROUP_CODE;
     txPacket.absTime = 0;
     l = strlen(&ErrorMsg[0]);
     for(i=0; i<l; i++) txPacket.payload[i] = ErrorMsg[i];
     txPacket.len = l + 4;
     EasyLink_transmit(&txPacket); //Функция библиотеки EasyLink
  }
}
*/



