ServiceEnergy/Tenzo_v1/CC1310T2bMain.c
// Задача BIOS, работает непрерывно, по семафору ReadyForTransmit передает пакет 868 MHz
// Структура данных хранится в буфере Buf_A[], длина буфера RFStrCnt
//---------------------------------------------------------------------------------------
void RFTransmitTaskA(UArg arg0, UArg arg1)
{
int i;
   while(1){
       Semaphore_pend(ReadyForTransmitA, BIOS_WAIT_FOREVER); //Ждем наступления семафора (передаем управление RTOS)
       txPacket.payload[0] = MASTER_ID_DEBUG_S;
       txPacket.payload[1] = DeviceID >> 16;
       txPacket.payload[2] = (DeviceID >> 8) & 0xFF;
       txPacket.payload[3] = DeviceID & 0xFF;
       txPacket.len        = 128; //
       txPacket.dstAddr[0] = GROUP_CODE;
       txPacket.absTime = 0;

       EasyLink_transmit(&txPacket); //Функция библиотеки EasyLink

       Semaphore_post(ReadyForBlink);
       Task_sleep(1000);



   }
}


// Init RF Module
// C:/ti/simplelink_cc13x0_sdk_4_20_02_07/docs/proprietary-rf/proprietary-rf-users-guide/easylink/easylink-api-reference-cc13x0.html
//---------------------------------------------------------------------------------------
void RFModule_init(void)
{
    //uint8_t addrFilter[EASYLINK_MAX_ADDR_SIZE * EASYLINK_MAX_ADDR_FILTERS] = {0xAA,0xA1};
    //uint8_t addrFilter[EASYLINK_MAX_ADDR_SIZE * EASYLINK_MAX_ADDR_FILTERS] = {0xAA, 0xE9,0xA1,0xA2,0xA3,0xA4,0xA5};
    EasyLink_init(EasyLink_Phy_Custom);
    EasyLink_setRfPwr(14);
    //EasyLink_enableRxAddrFilter(addrFilter, 1, 2); //Для первой строчки 2, для второй 7
}


// Init UART Module
//---------------------------------------------------------------------------------------
void UARTModule_init(void)
{
    UART_init();
    UART_Params_init(&uartParams);
    uartParams.writeDataMode = UART_DATA_BINARY;
    uartParams.readDataMode = UART_DATA_BINARY;
    uartParams.readReturnMode = UART_RETURN_FULL;
    uartParams.readEcho = UART_ECHO_OFF;
    uartParams.stopBits = UART_STOP_ONE;
    uartParams.baudRate = 115200;
    uartParams.readMode = UART_MODE_BLOCKING;
    //uartParams.writeCallback = writeCallback; //Прерывание
    uart = UART_open(0, &uartParams);
    if (uart == NULL) { while (1); }
}


/*
// Init UART
// Unblocking Callback mode
//---------------------------------------------------------------------------------------
void UARTModule_init(void)
{
    UART_init();
    UART_Params_init(&uartParams); //Сначала создать потом заполнить:(Настройка gsm UART сисдит в MDD_BASE_hub.c)
    uartParams.writeDataMode = UART_DATA_BINARY;    //UART_DATA_TEXT  UART_DATA_BINARY
    uartParams.readDataMode =  UART_DATA_BINARY;
    uartParams.readReturnMode = UART_RETURN_FULL ;  // UART_RETURN_FULL UART_RETURN_NEWLINE
    uartParams.readEcho = UART_ECHO_OFF;            // UART_ECHO_ON
    uartParams.dataLength = UART_LEN_8;
    uartParams.stopBits = UART_STOP_ONE;
    uartParams.baudRate = 115200;
    uartParams.readMode = UART_MODE_BLOCKING;   // UART_MODE_CALLBACK UART_MODE_BLOCKING
    //uartGSMParams.readCallback = UART_RxFxn;     //Обработчик прерывания
    //uartParams.writeCallback = writeCallback;    //Обработчик прерывания
    uartParams.readTimeout = 1000000;//500000;   //No timeout in UART_MODE_CALLBACK
    uartParams.writeTimeout= 1000000;            //UART_WAIT_FOREVER
}

*/



/*
 *  ============== Обработчик прерывания
 */
void IrqD_OUT(uint_least8_t index)
{

    GPIO_disableInt(D_OUT);//Отключили внешнее прерывание
    count_bits = 0;//Обнулили счётчик бит
    adc_value1=0;//Обнулили переменную
    GPIO_write(PD_SCK,0);
    GPTimerCC26XX_start(hTimer_I);
    GPIO_toggle(LED2);
    //flag = TRUE;

   /*
    count_bits = 0;//Обнулили счётчик бит
    GPIO_write(PD_SCK,0);
    GPTimerCC26XX_start(hTimer_I);//запускаем таймер
    GPIO_enableInt(D_OUT);//Отключили внешнее прерывание
    */
    /*
 uint8_t i=0;
    //Отключили прерывание D_OUT
    GPIO_disableInt(D_OUT);
    //Запустили цикл
    for( i=0;i<24;i++)
    {
        //Подняли строб
        GPIO_write(PD_SCK,1);
        //Сдвинули значение ADC на 1 влево
        adc_value1<<=1;
        Task_sleep(1);
        //Опустили строб
        GPIO_write(PD_SCK,0);
        //Проверяем уровень на пине D_OUT
        //Если там "1" то инкрементируем значение ADC
        if(GPIO_read(D_OUT)>0)
        {
            adc_value1++;
        }
        Task_sleep(1);
    }

    //Подняли строб
     GPIO_write(PD_SCK,1);
     //Подождали
     Task_sleep(1);
     //Опустили строб
     GPIO_write(PD_SCK,0);
     Task_sleep(1);
     //Выставляем симафор
     Semaphore_post(ReadyForHX);
     GPIO_enableInt(D_OUT);//Включим прерывание по ноге D_OUT
     Task_sleep(1000);
*/

}

